# Updating data frames

In [1]:
import numpy as np
import pandas as pd
import random  # Used for randomly sampling integers

# Set the seed
random.seed(42)

# Import data
URL = 'https://raw.githubusercontent.com/allisonhorst/palmerpenguins/main/inst/extdata/penguins.csv'
penguins = pd.read_csv(URL)

## ... using dictionary-like syntax

`df['new_col_name'] = new_column_values`

where the new_column_values could be:
- a pandas.Seires or numpy.array of the same length as the data frame, or
- a single scalar

The general syntax is:
# Add a new key-value pair to a dictionary
```
dict[new_key] = new_value
```

### Example

In [4]:
# Add new column body_mass_kg 
penguins['body_mass_kg'] = penguins['body_mass_g']/1000

# Confirm the new column is in the data frame
print("body_mass_kg is in the data frame's columns: ", 'body_mass_kg' in penguins.columns)

# Look at the new column
penguins.head()

body_mass_kg is in the data frame's columns:  True

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,body_mass_kg
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,3.75
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,3.80
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,3.25
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,3.45

### ... using the `assign()` method

The general syntax is :
```
df = df.assign(new_col_name=new_column_values)
```

In [1]:
(penguins.assign(bill_length_cm=penguins.bill_length_mm/10)
        .plot(kind='scatter',
              x='bill_length_cm', 
              y='body_mass_g')
    )

NameError: name 'penguins' is not defined

### ... at a specific location
General syntax:
```
df.insert(loc=integer_index,  # Location of new column
          column='new_col_name', 
          value=new_col_values)
```

## Example

In [6]:
# Create random 3-digit codes
codes = random.sample(range(100,1000), len(penguins))  # Sampling w/o replacement

# Insert codes at the front of data frame
penguins.insert(loc=0,  # Index
                column='id_code',
                value=codes)
        
penguins.head()

,id_code,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,body_mass_kg
0,754,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,3.75
1,214,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,3.80
2,125,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,3.25
3,859,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN
4,381,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,3.45

## Adding multiple columns

The general syntax:

```
df = df.assign(new_col1_name=new_col1_values, 
               new_col2_name=new_col2_values)
```

### Example

In [7]:
# Create columns with observer codes and flipper length in cm
penguins = penguins.assign(flipper_length_cm=penguins.flipper_length_mm/10, 
                           observer=random.choices(['A','B','C'],  # Sample with replacement
                                                    k=len(penguins))
                          )
# Examine result
penguins.head()

,id_code,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,body_mass_kg,flipper_length_cm,observer
0,754,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,3.75,18.1,C
1,214,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,3.80,18.6,A
2,125,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,3.25,19.5,C
3,859,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN,NaN,A
4,381,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,3.45,19.3,B

## Removing columns

Using the `drop()` method, the general syntax is:
```
df = df.drop(columns=col_names)
```

### Example

In [8]:
# Remove duplicate length and mass measurements
penguins = penguins.drop(columns=['flipper_length_mm','body_mass_g'])

# Confirm result
print(penguins.columns)

Index(['id_code', 'species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'sex', 'year', 'body_mass_kg', 'flipper_length_cm', 'observer'],
      dtype='object')

## Updating values

### A single valule
Using the locators:
- `at[]` to select by labels, or
- `iat[]` to select by position

The syntax for `at[]` is:
```
df.at[single_index_value, 'column_name']
```

`at[]` is similar to `loc[]`

### Example

In [9]:
# First update the index of the data frame to be id_code
penguins = penguins.set_index('id_code')

# Check bill length of penguin with ID 859
penguins.at[859, 'bill_length_mm']

# Correct bill length value of penguin with ID 859
penguins.at[859,'bill_length_mm'] = 38.3

# Confirm value was updated
penguins.loc[859]

species                 Adelie
island               Torgersen
bill_length_mm            38.3
bill_depth_mm              NaN
sex                        NaN
year                      2007
body_mass_kg               NaN
flipper_length_cm          NaN
observer                     A
Name: 859, dtype: object

The syntax for `iat[]` is: 
```
df.iat[index_integer_location, column_integer_location]
```
`iat[]` is similar to `iloc[]`

# Check-in

1. Obtain the location of the bill_length_mm column.

2. Use iat[] to access the same bill length value for the penguin with ID 859 and revert it back to an NA. Confirm your update using iloc[].

## Multiple values in a column
Updating multiple values in a column
- condition on the column values
- selecting a few values 

### Using a conditon
Creating a new column where the new values depend on conditions on another column

### Example
We want to classify the Palmer penguins such that :

- penguins with body mass less than 3kg as small,
- penguins with body mass greater or equal than 3 kg but less than 5 kg as medium,
- and those with body mass greater or equal than 5 kg as large.

In [10]:
# Create a list with the conditions
conditions = [penguins.body_mass_kg < 3, 
              (3 <= penguins.body_mass_kg) & (penguins.body_mass_kg < 5),
              5 <= penguins.body_mass_kg]

# Create a list with the choices
choices = ["small",
           "medium",
           "large"]

# Add the selections using np.select
penguins['size'] = np.select(conditions, 
                             choices, 
                             default=np.nan) # Value for anything outside conditions

# Display the updated data frame to confirm the new column
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,sex,year,body_mass_kg,flipper_length_cm,observer,size
id_code,,,,,,,,,,
754,Adelie,Torgersen,39.1,18.7,male,2007,3.75,18.1,C,medium
214,Adelie,Torgersen,39.5,17.4,female,2007,3.80,18.6,A,medium
125,Adelie,Torgersen,40.3,18.0,female,2007,3.25,19.5,C,medium
859,Adelie,Torgersen,38.3,NaN,NaN,2007,NaN,NaN,A,nan
381,Adelie,Torgersen,36.7,19.3,female,2007,3.45,19.3,B,medium

### By selecting values 
The general syntax: 
```
df.loc[row_selection, column_name] = new_values
```
where

- row_selection is the rows we want to update, this can be any expression that gives us a boolean pandas.Series,
- col_name is a single column name, and
- new_values is the new value or values we want. If using multiple values, then new_values must be of the same length as the number of rows selected.

Using `loc[]` in assignment modifies the data frame directly without the need for reassignment

### Example
We want to update the "male" values in the sex column to "M".

In [11]:
# Select rows with sex=male and simplify values in 'sex' column
penguins.loc[penguins.sex=='male', 'sex'] = 'M'

# Check changes in 'sex' column specifically
print(penguins['sex'].unique())

['M' 'female' nan]

# Check-in
Update the "female" values in the penguin data frame to "F". Don't use chained indexing. Confirm that the values in the column were updated.

## Example
We only want to use data from Biscoe island and, after doing some analyses, we want to add a new column to it:

In [ ]:
# Select penguins from Biscoe island
biscoe = penguins[penguins.island=='Biscoe']

# ... Other analyses ...

# Add a column
biscoe['sample_col'] = 100  # This raises SettingWithCopyWarning

In [12]:
# Make sure you get an independent data frame that won't alter the original
biscoe = penguins[penguins.island=='Biscoe'].copy()

# Add a column, no warning
biscoe['sample_col'] = 100

In [ ]:
# Confirm the new column is in our subset data
biscoe.head()

In [ ]:
# Confirm that original data was not modified
print('sample_column' in penguins.columns)